{
  "Asian": [
    {
      "title": "Fried Pork Belly",
      "picture": "http://www.bearnakedfood.com/wp-content/uploads/2018/06/DSCF2306.jpg",
      "prep-time": "20-30 minutes",
      "ingredients": [
        "2 quarts oil for frying, or as needed",
        "1 pound pork belly, cut into 1-inch squares"
      ],
      "recipe": "Heat about 4 inches of oil in a deep-fryer or large saucepan to 350 degrees F (175 degrees C). Fry pork belly squares in batches until golden brown, about 5 minutes. Drain on paper towels. Heat about 4 inches of oil in another large saucepan to 425 degrees F (218 degrees C). Fry pork belly squares in batches a second time until skin pops, 30 seconds to 1 minute. Drain on fresh paper towels.",
      "likes": 16,
      "unlikes": "0",
      "id": 1
    },
    {
      "title": "Spicy Thai Squid With Chiles and Cilantro",
      "picture": "https://static01.nyt.com/images/2013/12/18/dining/18JPAPPE4/18JPAPPE4-articleLarge.jpg",
      "prep-time": "25 minutes",
      "ingredients": [
        "1 pound cleaned squid",
        "2 tablespoons peanut oil",
        "1 tablespoon lime juice",
        "½ teaspoon finely grated lime zest",
        "2 teaspoons Asian fish sauce",
        "1 small shallot, peeled and finely chopped",
        "1 jalapeño, seeded if desired, and minced",
        "2 tablespoons roughly chopped cilantro",
        "Cucumber rounds or shot glasses, for serving",
        "Chopped roasted peanuts, for serving (optional)"
      ],
      "recipe": "Rinse squid under cool running water. Drain and transfer them to a paper towel to dry completely. Cut bodies into 1/2-inch rings and halve tentacles. Place a large skillet over high heat. Let pan get very hot, heating it for a good 5 minutes. Move half the squid from the paper towels to a bowl, so they don’t stick when you slide them into the pan. Add 1 tablespoon oil to skillet. Season squid with salt, slide them into the pan, and cook without moving for 1 minute. Flip squid and cook 30 seconds more. Repeat with remaining squid and oil. Don’t overcrowd the pan; if your skillet doesn’t fit the squid comfortably, cook them in smaller batches. ",
      "likes": 11,
      "unlikes": 2,
      "id": 2
    },
    {
      "title": "Chinese Orange Chicken",
      "picture": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F3864686.jpg&q=85",
      "prep-time": "15 minutes",
      "ingredients": [
        "4 Boneless Skinless Chicken Breasts cut into bite-size pieces",
        "3 Eggs whisked",
        "1/3 cup Cornstarch",
        "1/3 cup Flour",
        "Oil for frying",
        "1 cup Orange Juice",
        "1/2 cup Sugar",
        "2 Tablespoons Rice Vinegar or White Vinegar",
        "2 Tablespoons Soy Sauce use tamari for a gluten-free dish",
        "1/4 teaspoon Ginger",
        "1/4 teaspoon Garlic Powder or 2 garlic cloves, finely diced",
        "1/2 teaspoon Red Chili Flakes",
        "Orange Zest from 1 orange",
        "1 Tablespoon Cornstarch"
      ],
      "recipe": "Start with boneless skinless chicken breast or thighs.  Cut into bite-size pieces.  Dredge the chicken in whisked eggs and cornstarch/flour mixture until nice and coated. Get these chicken pieces ready for the oil. To make your homemade orange sauce, place orange juice, sugar, vinegar, soy sauce, garlic, ginger, and red chili flakes in a small pot and cook over medium-high heat. Add cornstarch and water and cook until thickened. Stir in oreange zest. Heat oil in a heavy-bottomed pot over medium-high heat. When frying foods, it is so helpful to use a thermometer. Let the oil heat up to 350 degrees.  Once the oil is ready, in batches, cook chicken for about 2 minutes until light golden brown.  Repeat with remaining chicken. Remove from oil and drain on a paper towel-lined plate.Toss fried chicken with the sweet orange sauce.  Top with grated orange zest and green onions. Serve immediately.",
      "likes": 10,
      "unlikes": 2,
      "id": 3
    },
    {
      "title": "Beef and Broccoli",
      "picture": "https://www.dinneratthezoo.com/wp-content/uploads/2017/10/beef-and-broccoli-stir-fry-14-500x500.jpg",
      "prep-time": "less than 20 minutes",
      "ingredients": [
        "3 Tablespoons cornstarch, divided",
        "1 pound flank steak, cut into thin 1-inch pieces",
        "1/2 cup low sodium soy sauce",
        "3 Tablespoons packed light brown sugar",
        "1 Tablespoon minced garlic",
        "2 teaspoons grated fresh ginger",
        "2 Tablespoons vegetable oil, divided",
        "4 cups small broccoli florets",
        "1/2 cup sliced white onions"
      ],
      "recipe": "In a large bowl, whisk together 2 tablespoons cornstarch with 3 tablespoons water. Add the beef to the bowl and toss to combine. In a separate small bowl, whisk together the remaining 1 tablespoon cornstarch with the soy sauce, brown sugar, garlic and ginger. Set the sauce aside. Heat a large nonstick sauté pan over medium heat. Add 1 tablespoon of the vegetable oil and once it is hot, add the beef and cook, stirring constantly until the beef is almost cooked through. Using a slotted spoon, transfer the beef to a plate and set it aside.Add the remaining 1 tablespoon of vegetable oil to the pan and once it is hot, add the broccoli florets and sliced onions and cook, stirring occasionally, until the broccoli is tender, about 4 minutes. Return the beef to the pan then add the prepared sauce. Bring the mixture to a boil and cook, stirring, for 1 minute or until the sauce thickens slightly. Serve with rice or noodles.",
      "likes": 13,
      "unlikes": 4,
      "id": 4
    }
  ],
  "Italian": [
    {
      "title": "Thick Italian Hot Chocolate",
      "picture": "https://i.ytimg.com/vi/ZGt0pJ0BEHM/maxresdefault.jpg",
      "prep-time": "20 minutes",
      "ingredients": [
        "3.5 ounces Dark Chocolate",
        "2 tablespoons sugar",
        "2 1/2 tablespoons cocoa unsweetened",
        "1 cup + 1 tablespoon milk",
        "1 teaspoon corn starch"
      ],
      "recipe": "In a small bowl whisk until smooth, 1/4 cup milk and cornstarch set aside.Sift the cocoa into a medium bowl then add the sugar and whisk together, set aside.In a small/medium pot heat 3/4 cups + 1 tablespoon milk until boiling reduce heat to low, start whisking and add the milk/cornstarch mixture then add the cocoa mixture slowly while continually whisking until smooth add the chopped chocolate and whisk for approximately 3 minutes. Serve immediately. Enjoy!",
      "likes": 81,
      "unlikes": 2,
      "id": 1
    },
    {
      "title": "Caprese Chicken with Smashed Potatoes",
      "picture": "https://pinchofyum.com/wp-content/uploads/Caprese-Chicken-2-Square.jpg",
      "prep-time": "1 hour",
      "ingredients": [
        "10–12 small red or gold potatoes",
        "olive oil, garlic powder, salt, and pepper",
        "fresh parsley or chives",
        "1 lb. chicken breasts (I like to cut 2 breasts lengthwise into thinner pieces to make a total of 4 pieces)",
        "olive oil, salt, and pepper",
        "6-ish roasted or sun dried tomatoes",
        "2 ounces havarti cheese, in small slices (any cheese works – be flexible)",
        "fresh basil",
        "balsamic reduction"
      ],
      "recipe": "Cooking the Potatoes: Preheat oven to 425 degrees. Cover potatoes with water in a pot. Bring to a boil. Once boiling, set timer for 10 minutes. Remove, drain, and allow to cool slightly.Smashing the Potatoes: One at a time, cover the potatoes with a clean dish towel. Mash gently it with your hand, holding it together so it doesn’t fall apart completely. Transfer to a baking sheet. Drizzle with olive oil. Sprinkle with garlic powder, salt, and pepper. Bake for 10-15 minutes.Cooking the Chicken: In an oven-safe skillet, heat a little oil in a skillet over medium heat. Sprinkle the chicken with salt and pepper. Brown on both sides (but it doesn’t have to be cooked through). Top with the sun dried tomatoes and cheese slices. Transfer the pan to the oven and bake for 8-10 minutes, until the chicken is cooked through and cheese is nice and melty.Serve: Top the chicken with basil and balsamic reduction. Serve with potatoes.",
      "likes": 16,
      "unlikes": 9,
      "id": 2
    },
    {
      "title": "Tuscan Chicken",
      "picture": "https://juliasalbum.com/wp-content/uploads/2019/11/creamy-tuscan-chicken-1-500x500.jpg",
      "prep-time": "30 minutes",
      "ingredients": [
        "2 tablespoons olive oil",
        "2 pounds boneless chicken breasts, trimmed",
        "1 teaspoon kosher salt",
        "1 teaspoon fresh ground pepper",
        "1 (15- ounce) jar Alfredo Sauce",
        "2 cloves garlic, minced",
        "1 (7- ounce) jar sun-dried tomatoes, drained and diced",
        "2 teaspoons Italian seasoning",
        "1/2 cup fresh grated Parmesan cheese",
        "8– ounces fresh baby spinach"
      ],
      "recipe": "In a large, 12- inch skillet heat the olive oil over medium heat.Season the chicken breasts with salt and pepper and place the chicken in the hot skillet. Cook for 5-6 minutes on each side, until browned.In a large bowl stir together the Alfredo sauce, garlic, sun-dried tomatoes, Italian seasoning, and cheese, mixing combined.When chicken is browned, turn the heat down to low and pour sauce on top of the chicken. Stir to coat, and cover the skillet and cook for 10 minutes, until the chicken is cooked.Add the spinach to the skillet, pressing down into the sauce as much as you can. Cover and cook for 5 more minutes, or until the spinach is wilted.Stir to combine evenly and serve.",
      "likes": 1,
      "unlikes": 44,
      "id": 3
    },
    {
      "title": "Neapolitan Pizza Recipe",
      "picture": "https://www.italymagazine.com/sites/default/files/feature-story/leader/pizza-margherita-napoletana.jpg",
      "prep-time": "1 hour",
      "ingredients": [
        "1 ball Best Homemade Pizza Dough",
        "1/3 cup Easy Pizza Sauce",
        "3 ounces fresh mozzarella cheese (or about 3/4 cup shredded mozzarella)",
        "2 basil leaves",
        "Kosher salt",
        "Semolina flour or cornmeal, for dusting the pizza peel"
      ],
      "recipe": "Prepare the dough using the Best Pizza Dough recipe (follow this video instruction for more). Follow the preparation instructions in the dough recipe if prepared in advance.Place a pizza stone in the oven and preheat to 500°F. OR preheat your pizza oven (here’s the pizza oven we have!).Make the Homemade Pizza Sauce.Slice the mozzarella into 1/4 inch thick pieces. If it’s incredibly watery fresh mozzarella (all brands vary), you may want to let it sit on a paper towel to remove moisture for about 15 minutes then dab the mozzarella with the paper towel to remove any additional moisture.When the oven is ready, stretch the dough into a circle; see How to Stretch Pizza Dough for instructions. Sprinkle a pizza peel with semolina flour or cornmeal, then carefully place the dough on top. Spread the pizza sauce across the dough. Top with mozzarella cheese.  Taste a bite of the mozzarella cheese; if it does not taste salty, add a few pinches of kosher salt to the pizza.If you’re baking in a pizza oven, add the basil leaves. For baking in a standard oven, add the basil leaves after you bake (the leaves turn black in a standard oven).Transfer the pizza to the pizza stone on the pizza peel, then bake until the cheese is melted, about 7 minutes in the oven (or 1 minute in the pizza oven). Slice into pieces and serve immediately.",
      "likes": 52,
      "unlikes": 1,
      "id": 4
    }
  ],
  "Mediterranean": [
    {
      "title": "Baked Lemon Garlic Salmon Recipe",
      "picture": "https://www.cakenknife.com/wp-content/uploads/2020/01/Baked-Lemon-Garlic-Salmon_thumbnail-1-480x480.jpg",
      "prep-time": "30 minutes",
      "ingredients": [
        "2 lb salmon fillet",
        "Kosher salt",
        "Extra virgin olive oil",
        "½ lemon, sliced into rounds",
        "Parsley for garnish"
      ],
      "recipe": "Heat oven to 375 degrees F. Prepare a sheet pan lined with a large piece of foil (should be large enough to fold over salmon). Brush top of the foil with extra virgin olive oil.Now, pat salmon dry and season well on both sides with kosher salt. Place it on the foiled sheetpan. Top with lemon garlic sauce (make sure to spread the sauce evenly.)Fold foil over the salmon (seam-side up). Bake for 15 to 20 minutes until salmon is almost completely cooked through at the thickest part (cooking time will vary based on the thickness of your fish. If your salmon is thinner, check several minutes early to ensure your salmon does not overcook. If your piece is very thick, 1 ½ or more inches, it may take a bit longer.)Carefully remove from oven and open foil to uncover the top of the salmon.  Place under the broiler briefly, about 3 minutes or so. Watch closely as it broils to make sure it doesn’t overcook and the garlic does not burn.)",
      "likes": 22,
      "unlikes": 5,
      "id": 1
    },
    {
      "title": "Chicken Shawarma",
      "picture": "https://hips.hearstapps.com/vidthumb/images/190130-chicken-shwarma-horizontal-1551285400.png",
      "prep-time": "40 minutes",
      "ingredients": [
        "8 boneless, skinless chicken thighs",
        "1 large onion, thinly sliced",
        "1 large lemon, juice of",
        "⅓ cup Private Reserve extra virgin olive oil",
        "5 tsbp Mediterranean spice mix",
        "6 pita pockets",
        "Tahini sauce or Greek Tzatziki sauce",
        "Baby arugula",
        "Pickles or kalmata olives (optional)"
      ],
      "recipe": "In a small bowl, mix the cumin, turmeric, coriander, garlic powder, sweet paprika and cloves. Set aside the shawarma spice mix for now.Pat the chicken thighs dry and season with salt on both sides, then thinly slice into small bite-sized pieces.Place the chicken in a large bowl. Add the shwarma spices and toss to coat. Add the onions, lemon juice and olive oil. Toss everything together again. Cover and refrigerate for 3 hours or overnight (if you don't have time, you can cut or skip marinating time)When ready, preheat the oven to 425 degrees F. Take the chicken out of the fridge and let it sit in room temperature for a few minutes.Spread the marinated chicken with the onions in one layer on a large lightly-oiled baking sheet pan. Roast for 30 minutes in the 425 degrees F heated-oven. For a more browned, crispier chicken, move the pan to the top rack and broil very briefly (watch carefully). Remove from the oven.While the chicken is roasting, prepare the pita pockets. Make tahini sauce according to this recipe or Tztaziki sauce according to this recipe. Make 3-ingredient Mediterranean salad according to this recipe. Set aside.To serve, open pita pockets up. Spread a little tahini sauce or Tzatziki sauce, add chicken shawarma, arugula, Mediterranean salad and pickles or olives, if you like. Serve immediately!",
      "likes": 14,
      "unlikes": 1,
      "id": 2
    },
    {
      "title": "Lemon Garlic Baked Chicken Drumsticks",
      "picture": "https://wonkywonderful.com/wp-content/uploads/2018/01/garlic-lemon-chicken-drumsticks-3.jpg",
      "prep-time": "35 minutes",
      "ingredients": [
        "10 to 12 chicken drumsticks bone in, skin on",
        "1 tbsp black pepper and kosher salt",
        "1 tbsp dry oregano",
        "1 ½ tsp coriander 1 tsp sweet paprika ½ tsp cumin",
        "1 head garlic about 12 garlic cloves, peeled and chopped",
        "1 medium yellow onion cut into wedges",
        "Zest and juice of 2 lemons + 1 lemon sliced",
        "¼ cup extra virgin olive oil I used Private Reserve Greek olive oil"
      ],
      "recipe": "Pat chicken dry and season with kosher salt, be sure to season under the skin too. If you have the time, arrange the chicken on a tray or a shallow dish and chill in the fridge uncovered for a few hours or overnight (optional.)Place the chicken in a large zip bag. In a small bowl, combine spices (oregano, black pepper, coriander, paprika, and cumin.) Add the spices to the chicken in the bag.Add the garlic, onion, lemon zest, lemon juice, and olive oil. Zip the bag shut. Toss chicken around and massage to make sure it is well coated in the marinade. Let the chicken marinate for about 30 minutes, or if you have the time, refrigerate for 2 to 4 hours.When ready, heat the oven to 450 degrees F.Lightly oil a baking dish and arrange the chicken drumsticks (yes, include the onions and the marinade). Arrange lemon slices in between.Bake for 35 minutes or until the chicken is fully cooked and its juices run clear (internal temperature of chicken should register 165 degrees F using an instant read thermometer). If you like, broil for just a few minutes until skins are crispy to your liking.",
      "likes": 6,
      "unlikes": 6,
      "id": 3
    },
    {
      "title": "Mediterranean Garlic Shrimp Pasta Recipe",
      "picture": "https://tmbidigitalassetsazure.blob.core.windows.net/rms3-prod/attachments/37/1200x1200/Mediterranean-Shrimp-Linguine_exps120872_SD2232457C08_26_3bC_RMS.jpg",
      "prep-time": "20 minutes",
      "ingredients": [
        "¾ lb thin spaghetti",
        "Extra virgin olive oil",
        "1 lb large shrimp peeled and deveined (thawed if frozen)",
        "1 teaspoon dry oregano ½ teaspoon red pepper flakes black pepper",
        "½ red onion chopped",
        "5 garlic cloves minced",
        "1 cup dry white wine I used Pinot Grigio",
        "1 large lemon, juice of",
        "Large handful chopped fresh parsley about 1 cup packed",
        "2 to 3 vine ripe tomatoes chopped",
        "Parmesan cheese to your liking."
      ],
      "recipe": "Cook the pasta in salted boiling water according to package (about 9 minutes). Reserve a little bit of the starchy pasta cooking water. Drain the pasta well.While the pasta is cooking, cook the shrimp. In a large pan heat 1 tablespoon extra virgin olive oil over medium-high heat until the oil is shimmering but not smoking. Cook the shrimp on each side for 2 to 3 minutes until it turns pink. Transfer the shrimp to a side plate for now.In the same pan add a little more extra virgin olive oil, if needed. Reduce the heat to medium-low. Add the onions, garlic, oregano and red pepper flakes (I used Aleppo-style pepper). Cook for 1 to 2 minutes, stirring constantly. Add the wine to the pan and scrape up any pieces of garlic and onions. Cook the wine for 1 minute to reduce then add the lemon juice and lemon zest.Add the chopped parsley and tomatoes, toss about for about 30 to 40 seconds. Season with Kosher salt.Add the cooked pasta to the pan, and toss to coat. Add some of the pasta starchy water if you need to.Finally, add the cooked shrimp. Allow the shrimp to warm through briefly (another 30 seconds), then remove the pasta from heat.To finish, sprinkle a little grated parmesan cheese and more red pepper flakes or Aleppo pepper. Serve immediately!",
      "likes": 14,
      "unlikes": 7,
      "id": 4
    }
  ],
  "Mexican": [
    {
      "title": "Crab tostadas",
      "picture": "https://3f4c2184e060ce99111b-f8c0985c8cb63a71df5cb7fd729edcab.ssl.cf2.rackcdn.com/media/13879/crabtostadas.jpg",
      "prep-time": "50 minutes",
      "ingredients": [
        "guajillo or chipotle powder 1 tsp, tamarind paste 1 tbsp, lime ½, juiced",
        "brown crabmeat 125g",
        "onion 1 small, finely chopped",
        "white crabmeat 225g, picked",
        "cucumber ¼, diced",
        "jalapeño ½, thinly sliced",
        "coriander a small bunch, stalks finely chopped, leaves roughly chopped",
        "lime ½-1, juiced"
      ],
      "recipe": "Heat the oven to 120C/fan 100C/gas ½ and tear the tortillas in half. Spread out onto baking trays and cook in the oven for 40-50 minutes or until dry and crisp.For the brown crabmeat base, heat the oil in a pan and cook the onion with a pinch of salt for 5-10 minutes or until softened. Add the guajillo powder and cook for another minute. Add the tamarind, lime juice and brown crabmeat, season and stir.For the white crabmeat topping, combine the crabmeat, cucumber, jalapeño, coriander and lime juice (to taste), then season. Spoon the brown crabmeat onto the warm tostadas, then pile the white crabmeat mixture on top. Garnish with some avocado, coriander leaves, jalapeño slices and lime wedges.",
      "likes": 18,
      "unlikes": "0",
      "id": 1
    },
    {
      "title": "Chicken enchiladas",
      "picture": "https://www.jessicagavin.com/wp-content/uploads/2018/04/chicken-enchiladas-5-1200.jpg",
      "prep-time": "40 minutes",
      "ingredients": [
        "chicken breasts 2, cut into thin slices",
        "vegetable oil 2 tsp",
        "red onion 1, finely sliced, red pepper 1, sliced, yellow pepper 1, sliced",
        "garlic 3 cloves, thinly sliced",
        "green chilli 1, finely chopped",
        "fajita spice mix (we used Gran Luchito Smoky Chipotle Fajita & Taco Mix) 2 tbsp, plus 2 tsp",
        "spinach 80g",
        "black beans 400g tin, rinsed and drained",
        "coriander a small bunch, finely chopped",
        "passata 680g jar",
        "large white tortillas 4",
        "mature cheddar 75g, grated",
        "half-fat soured cream 100g"
      ],
      "recipe": "Heat the oven to 200C/fan 180C/gas 6. Fry the chicken in the vegetable oil in a frying pan over a high heat for 5 minutes until golden all over, then scoop out onto a plate. Add in the onion and peppers, and fry for 5 minutes until charred. Add in the garlic and 1/2 of the chopped chillies and fry for 1 minute before adding 2 tbsp of the fajita spice mix and the spinach. Cook for a minute to wilt, then stir in the beans, coriander, 100ml of passata, the cooked chicken and some seasoning.Put 1⁄4 of the chicken mixture along the middle of one tortilla, then roll up and put into a baking dish, and repeat with the remaining chicken and tortillas. Pour the passata into a bowl and add 2 tsp of fajita spice mix and lots of seasoning. Pour this all around the wraps, then top with the grated cheddar and remaining chopped chilli. Bake in the oven for 30 minutes until crisp and bubbling on top, then serve with soured cream.",
      "likes": 17,
      "unlikes": 10,
      "id": 2
    },
    {
      "title": "Tacos al pastor",
      "picture": "https://cdn.kiwilimon.com/recetaimagen/13996/6330.jpg",
      "prep-time": "1 hr + ",
      "ingredients": [
        "boneless pork shoulder 1.5kg, skin and large pieces of fat removed, meat cut into ½cm-thick slices",
        "pineapple 1, cut into 1cm slices",
        "red onion 1 large, cut into thick slices",
        "coriander a handful of leaves",
        "fresh orange juice 50ml",
        "achiote paste 50g, see notes below",
        "guajillo chillies 4, stems removed, see notes below",
        "garlic 4 cloves",
        "taco seasoning"
      ],
      "recipe": "For the marinade, crumble the achiote into the orange juice and leave for 5 minutes.In a dry pan over a medium heat, fry the chillies for 3-4 minutes or until charred, then add to a food processor with the achiote and orange juice, and the remaining marinade ingredients. Whizz to combine, then pour all over the meat. Cover and chill overnight or for at least 4 hours.Prepare the BBQ for direct cooking by spreading the coals in an even layer. Brush the pineapple and onion with a little oil, and cook for a few minutes, turning once, until charred. Dice, season and mix with the coriander.Grill the pork for 4-5 minutes on each side, turning, until the outside is charred but the meat on the inside is cooked through. (Alternatively, heat the grill to high and grill for 5 minutes each side, or until charred and cooked through.) Rest for 5 minutes under foil, then chop into small pieces, serving with the onion and pineapple, tortillas and lime wedges for squeezing over.Achiote paste is made from annatto seeds and has an earthy, peppery flavour. Guajillo chilli is dried mirasol chilli – it has aromatic sweetness with mild heat.",
      "likes": 10,
      "unlikes": 2,
      "id": 3
    },
    {
      "title": "Spicy Mexican rice",
      "picture": "https://images.immediate.co.uk/production/volatile/sites/2/2020/06/Steven-Joyce-JOS2020026D00012-FS_preview-7786183.jpg?quality=90&resize=768,574",
      "prep-time": "30 minutes",
      "ingredients": [
        "groundnut oil 1 tbsp",
        "onion 1 large, finely chopped",
        "garlic 2 cloves, crushed",
        "green chilli 1, sliced",
        "green pepper 1, diced",
        "basmati rice 200g",
        "chipotle paste 1 tbsp",
        "chopped tomatoes 400g tin",
        "vegetable stock 250ml",
        "coriander a handful, chopped",
        "lime wedges to serve"
      ],
      "recipe": "Heat the oil in a deep lidded frying pan. Cook the onion, garlic, chilli and pepper for 10 minutes until starting to soften. Stir in the basmati, then cook for 3-4 minutes, stirring all the time.Mix in the chipotle paste and cook, stirring for a couple of minutes until fragrant, then tip in the tomatoes and stock, and stir well.Bring to a simmer then turn the heat down to low, put on a lid and cook for 15 minutes or until the rice is tender and cooked through. Stir through the coriander and serve with lime wedges for squeezing.",
      "likes": 12,
      "unlikes": 4,
      "id": 4
    }
  ],
  "comments": [
    {
      "content": "Taste great and easy to make.",
      "AsianId": 4,
      "id": 1
    },
    {
      "content": "Worth the time it took to make it very good.",
      "ItalianId": 2,
      "id": 2
    },
    {
      "content": "Delicious!",
      "AsianId": 1,
      "id": 3
    },
    {
      "content": "I make this every Friday night its so good.",
      "AsianId": 2,
      "id": 4
    },
    {
      "content": "Great recipe super easy!",
      "AsianId": 3,
      "id": 5
    },
    {
      "content": "It taste just like Panda Express",
      "AsianId": 3,
      "id": 6
    },
    {
      "content": "Don't forget to eat with rice!",
      "AsianId": 4,
      "id": 7
    },
    {
      "content": "Made my Italian mother proud.",
      "ItalianId": 1,
      "id": 8
    },
    {
      "content": "Great on a cold winter day!",
      "ItalianId": 1,
      "id": 9
    },
    {
      "content": "Great seasoning!",
      "ItalianId": 3,
      "id": 10
    },
    {
      "content": "Super reliable recipe very good",
      "ItalianId": 4,
      "id": 11
    },
    {
      "content": "Super good and super quick",
      "MediterraneanId": 1,
      "id": 12
    },
    {
      "content": "A great quick dinner for the family",
      "MediterraneanId": 1,
      "id": 13
    },
    {
      "content": "The seasoning was out of this world everything blended well together.",
      "MediterraneanId": 2,
      "id": 14
    },
    {
      "content": "Very light oven bake recipe for family dinner night.",
      "MediterraneanId": 3,
      "id": 15
    },
    {
      "content": "Out of the world pasta everything works great together.",
      "MediterraneanId": 4,
      "id": 16
    },
    {
      "content": "Never thought crab and tacos went well together. Try the recipe its phenomenal.",
      "MexicanId": 1,
      "id": 17
    },
    {
      "content": "worth the time it took to cook it!",
      "MexicanId": 2,
      "id": 18
    },
    {
      "content": "Amazing street taco recipe",
      "MexicanId": 3,
      "id": 19
    },
    {
      "content": "quick and easy",
      "AsianId": 1,
      "id": 20
    },
    {
      "content": "Great with tacos",
      "MexicanId": 4,
      "id": 21
    }
  ]
}